Rails-Training1/task_app/app/controllers/admin/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "テストユーザー6 new"], ["password_digest", "$2a$12$H2AnWdkkQ.45GeCqdmP53udRvRyP9BskAJtWDW2KLwq/RXTVUvZ.G"], ["updated_at", "2023-03-14 07:13:38.287322"], ["id", 6]]