Rails-Training1/task_app/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test2"], ["description", "testtest"], ["created_at", "2023-03-09 05:11:17.837292"], ["updated_at", "2023-03-09 05:11:17.837292"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "テスト1詳細 編集済"], ["updated_at", "2023-03-09 02:19:21.724102"], ["id", 1]]
---
    task = Task.find(params[:id])
    task.update!(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
    task = Task.find(params[:id])
    task.destroy